Revit 2027 API
SSEPointVisibilitySettings.SetVisibility Method
 Sets the SSE point visibility for the given category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetVisibility(
	Document document,
	ElementId categoryId,
	bool isVisible
)
Public Shared Sub SetVisibility (
	document As Document,
	categoryId As ElementId,
	isVisible As Boolean
)
public:
static void SetVisibility(
	Document^ document,
	ElementId^ categoryId,
	bool isVisible
)
static member SetVisibility :
        document : Document *
        categoryId : ElementId *
        isVisible : bool -> unit
Parameters
document Document
 The document.
categoryId ElementId
 The category id.
isVisible Boolean
 The visibility of the given category. True means the SSE points are visible.
Exceptions
Exception | Condition
ArgumentException |  The category is not valid for SSE.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SSEPointVisibilitySettings Class
Autodesk.Revit.DB Namespace